Revit 2027 API
IFCData.GetTypeList Method
 Gets the multiple strings represent one IFC type name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetTypeList()
Public Function GetTypeList As IList(Of String)
public:
IList<String^>^ GetTypeList()
member GetTypeList : unit -> IList<string>
Return Value
IList<String>
 The strings.
Exceptions
Exception | Condition
InvalidOperationException |  No type assigned or it is a simple type.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace